<script setup lang="ts">
import type { AccordionItem } from '@nuxt/ui'

const items: AccordionItem[] = [
	{
		label: 'Что означает уровень Tier III для вашего дата-центра?',
		content: 'Центр находится в Москве, в охраняемом технологическом парке. Доступ к инфраструктуре осуществляется через защищённые каналы связи, а данные хранятся в соответствии с требованиями 152-ФЗ.',
	},
	{
		label: 'Где физически расположен ваш дата-центр?',
		content: 'Центр находится в Москве, в охраняемом технологическом парке. Доступ к инфраструктуре осуществляется через защищённые каналы связи, а данные хранятся в соответствии с требованиями 152-ФЗ.',
	},
	{
		label: 'Как обеспечивается защита данных?',
		content: 'Центр находится в Москве, в охраняемом технологическом парке. Доступ к инфраструктуре осуществляется через защищённые каналы связи, а данные хранятся в соответствии с требованиями 152-ФЗ. Центр находится в Москве, в охраняемом технологическом парке. Доступ к инфраструктуре осуществляется через защищённые каналы связи, а данные хранятся в соответствии с требованиями 152-ФЗ.',
	},
	{
		label: 'Есть ли у вас SLA (Service Level Agreement)?',
		content: 'Центр находится в Москве, в охраняемом технологическом парке. Доступ к инфраструктуре осуществляется через защищённые каналы связи, а данные хранятся в соответствии с требованиями 152-ФЗ.',
	},
	{
		label: 'Почему ваши цены ниже, чем у конкурентов?',
		content: 'Центр находится в Москве, в охраняемом технологическом парке. Доступ к инфраструктуре осуществляется через защищённые каналы связи, а данные хранятся в соответствии с требованиями 152-ФЗ.',
	},
	{
		label: 'Как быстро можно начать работу после заявки?',
		content: 'Центр находится в Москве, в охраняемом технологическом парке. Доступ к инфраструктуре осуществляется через защищённые каналы связи, а данные хранятся в соответствии с требованиями 152-ФЗ.',
	},
	{
		label: 'Помогаете ли с переносом данных из другого дата-центра?',
		content: 'Центр находится в Москве, в охраняемом технологическом парке. Доступ к инфраструктуре осуществляется через защищённые каналы связи, а данные хранятся в соответствии с требованиями 152-ФЗ.',
	},
	{
		label: 'Есть ли тестовый период?',
		content: 'Центр находится в Москве, в охраняемом технологическом парке. Доступ к инфраструктуре осуществляется через защищённые каналы связи, а данные хранятся в соответствии с требованиями 152-ФЗ.',
	},
	{
		label: 'Как быстро можно начать работу после заявки?',
		content: 'Центр находится в Москве, в охраняемом технологическом парке. Доступ к инфраструктуре осуществляется через защищённые каналы связи, а данные хранятся в соответствии с требованиями 152-ФЗ.',
	},
	{
		label: 'Помогаете ли с переносом данных из другого дата-центра?',
		content: 'Центр находится в Москве, в охраняемом технологическом парке. Доступ к инфраструктуре осуществляется через защищённые каналы связи, а данные хранятся в соответствии с требованиями 152-ФЗ.',
	},
]
</script>

<template>
	<h1 class="font-bold text-3xl mb-8">
		FAQ
	</h1>
	<UAccordion
		:items="items"
		:ui="{
			root: 'max-w-[700px] mx-auto grid gap-[15px]',
			item: 'bg-white rounded-[16px] text-base',
			trigger: 'py-4.5 px-6 font-semibold text-base',
			content: 'px-6 text-(--black-800)',
			body: 'text-base leading-[22px] pb-6',
			trailingIcon: 'size-6',
		}"
	/>
</template>
